## 범용주석
# 본 ini파일은 각 공격의 패턴을 설정하는데 필요한 정보를 담고 있음.
# HP, 모션의 길이, 시간개념, 탄환수, 발사횟수등 "대미지"를 제외한 나머지 요소를 다룸.
# 대미지 관련 정보는 Weapon-boss01-x.ini 파일에서 다룸.
# 거리 = 픽셀(pixel)
# 틱 = 1/33 초
################################################## 크기 및 HP설정 #################################
[General]
# 몸통 크기 비율
SizeRatio=1.2
SizeRatioLeft=1.0
SizeRatioRight=1.0
# 주의 : x방향90%, y방향90% 라면 면적은 81% 가 된다
# 면적대비 90% 라면 0.94 정도로 입력해야

#size
Size=160
SizeLeft=130
SizeRight=130

# HP
P1BothHP=720
P2LeftHP=432
P2RightHP=432

# 충돌 데미지
MeleeDamage=30
MeleeDamageLeft=23
MeleeDamageRight=23

#보스 시작지점
startPosx=400
startPosy=500
#쉘 위치 = 보스 시작지점  + startShellPos
startShellPosx=300
startShellPosy=200

#공략포인트 지정용 이팩
PointEffectFileName=Effects/Quest06/Efx/Boss06_RangeMark00.efx

#중점으로 이동시 분리되기 위한 좌표값
Reserved4Pos0X=500
Reserved4Pos0Y=600
Reserved4Pos1X=1100
Reserved4Pos1Y=600
Reserved4Pos2X=800
Reserved4Pos2Y=400
Reserved4Pos3X=800
Reserved4Pos3Y=800


################################################## 페이즈 설정 ####################################
# idle1, idle2, 
# p1ms, p1mm, p1mb, p1mh, p1CircleMove, p1Fission
# p2ms, p2mm, p2mb, p2mh, ElectricAttack, SpeedUp,Bond,Ghost,p2CircleMove
# 1. 대소문자 구분합니다. 
# 2. 1 다음에 #으로 막아버리거나 번호가 이어지지 않으면 더이상 패턴 추가 안됩니다

# 페이즈1 공격패턴 - 
# 페이즈2 공격패턴 - 

[phase1]
type=order
1=idle2
2=p1mm
3=p1mb
4=p1ms,2
5=idle1
6=p1Fission
7=p1mm,2
8=idle1
9=p1mh,2
10=p1CircleMove
11=idle2
12=p1mb,2
13=p1mh
14=idle2
15=p1mm
16=p1mb
17=p1mm
18=idle1
19=p1Fission
20=p1mh
21=idle2
22=p1ms
23=p1mm


[phase2]
type=order
1=idle2
2=p2ms
3=p2mm
4=p2mb,2
5=idle2
6=p2CircleMove
7=p2mh
8=idle1
9=Bond
10=SpeedUp
11=idle1
12=p2ms
13=p2mm
14=idle2
15=Ghost
16=ElectricAttack
17=idle2
18=p2mb,2
19=p2mh
20=idle1
21=Bond
22=SpeedUp
23=idle2,2
24=ElectricAttack



##################################################### 사망 ########################################
[Death]
Animation=Die,2.0
##################################################### 출현 ########################################
[Birth]
AnimationSmallShake=ShakeSmall,1.0
AnimationBigShake=ShakeBig,1.0
AnimationBreak=Break
#시작하고 smallshake하고
TickSmallShake=0
#그 이후에 240만큼 bigshake하고
TickBigShake=0
#그 후에 60tick동안 기다리고
TickWait=70
#birth끝나는 tick
TickEnd=60
EffFileName=Boss06_DieExplo00.efx
# 지진 효과 = 시작틱, 끝틱, 반복틱, 주기시간, 진폭, 유지시간,방향(0=좌우,1=상하)#이거는 약간 흔들릴때
Shake=0,270,5,5,8,5,1
#이거는 깨질때
ShakeWhenBreak=0,150,5,5,8,10,1
##################################################### 휴식 ########################################
[Idle]
Idle1Animation=Idle,0.5
Idle2Animation=Idle,1.0
Idle3Animation=Idle,1.0,0,cycle
################################################### 페이즈2 #######################################
//Phase2로 변환될때 잠시 머문다
[Phase2Start]
Animation=둘로나뉘기,2.0
#얼마나 기다리다 페이즈 2 시작할것인가
Phase2TickEnd=30
TickFade=60
##################################################### 총알 ########################################
#BulletCount : 총구 하나에서 몇발이 날라가는가
#BulletAngle : 총구 하나에서 여러발이 날라갈때 몇도씩 꺽어줄것인가
#AttackCount : 몇번 쏠 것인가
#BulletPos0  : 각 총구는 어떤 총구를 쓸것인가. 0이 12시 방향.
#[P1MS]      : P1 = phase1 M = Missile S = small
#S = Small M = Medium B = Big H = Homming

############################################## 페이즈1 작은 미사일#################################
[p1ms]
AnimationStart=화난표정미사일공격,5.0
Animation=화난표정미사일공격,1.0 #,1000,cycle
AnimationEnd=화난표정미사일공격,5.0
TickStart=30
TickInterval=30
AttackCount=3
BulletAngle0=10
BulletAngle1=10
BulletAngle2=10
BulletCount0=3
BulletCount1=3
BulletCount2=3
BulletPos0=5
#BulletPos1=7
#BulletPos2=9
#BulletPos3=8
#BulletPos4=10

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=1

############################################## 페이즈1 중간 미사일#################################
[p1mm]
AnimationStart=화난표정미사일공격,5.0
Animation=화난표정미사일공격,1.0 #,1000,cycle
AnimationEnd=화난표정미사일공격,5.0
TickStart=30
TickInterval=30
AttackCount=3
BulletAngle0=5
BulletAngle1=5
BulletAngle2=5
BulletCount0=5
BulletCount1=5
BulletCount2=5
BulletPos0=5
#BulletPos1=6
#BulletPos2=7
#BulletPos3=8
#BulletPos4=9

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=1

############################################## 페이즈1 큰 미사일#################################
[p1mb]
AnimationStart=화난표정미사일공격,5.0
Animation=화난표정미사일공격,1.0 #,1000,cycle
AnimationEnd=화난표정미사일공격,5.0
TickStart=20
TickInterval=30
AttackCount=2

#각 총알간 간격
BulletAngle0=15
BulletAngle1=15
#두번째 발사시 각도 휘어짐
BulletAngleNext=8
#한번쏠때 몇발을 쏠것인가
BulletCount0=24
BulletCount1=24
#첫번째 쏠때의 방향
BulletPos0=0
#두번째 쏠때의 방향
BulletPos1=10

LengthFromCenter=200

############################################## 페이즈1 유도 미사일#################################
[p1mh]
AnimationStart=웃는표정유도미사일공격,3.0
Animation=웃는표정유도미사일공격,1.0 #,1000,cycle
AnimationEnd=웃는표정유도미사일공격,3.0

TickStart=30
TickInterval=10
AttackCount=3
BulletAngle0=8
BulletAngle1=7
BulletAngle2=8
BulletCount0=2
BulletCount1=2
BulletCount2=2
BulletPos0=5
BulletPos1=6
BulletPos2=7
BulletPos3=8
BulletPos4=9

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=0

########################################### 페이즈1 분열################################################
[p1Fission]
AnimationStart=쇠공뱉기,1.0
Animation=쇠공뱉기,1.0#,cycle
AnimationEnd=쇠공뱉기,1.0
TickStart=1
TickInterval=45
AttackCount=2
BulletAngle0=45
BulletAngle1=45
BulletCount0=4
BulletCount1=4
BulletPos0=5
BulletPos1=6
#BulletPos2=7
#BulletPos3=8
#BulletPos4=9

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=1

############################################### 페이즈1 바닥쓸기#########################################
#이동 관련만 여기에 있고 이동하면서 쏘는 미사일은 위에 p1DM과 p2DM에 있다
[p1CircleMove]
AnimationStart=우는표정바닥쓸기,1.0
Animation=우는표정바닥쓸기,1,6000,cycle
AnimationEnd=우는표정바닥쓸기,1.0

# 지진 효과 = 시작틱, 끝틱, 반복틱, 주기시간, 진폭, 유지시간,방향(0=좌우,1=상하)
Shake=0,270,5,5,8,5,1

#강하
LandingVelocity=19
LandingEndTick=30
LandingOverEFX=CH00_DashHit00.efx
LandingOverSound=ch00@Dash

#이동
DashTick=480
DashSpeedUpTick=100
DashSpeedDownTick=100
DashAccelTick=20
DashAccel=1
DashVelocityWhenStart=20
Direction=1 #-1=반대방향
#타원의 반지름과 y축 변수
Radius=680
yFactor=2.0
#중심좌표
centerX=800
centerY=600
#이펙트
DashEFX=
#사운드
DashSound=boss06@dashdown

#부양
DashEndTick=30


#기본 속도
MovingVelocity=19


################################## 페이즈1 바닥쓸기 공격시 미사일 공격#################################
#Phase1 Dash Missile
[p1DM]
Animation=Atk_Bullet,1,1500,cycle
TickStart=30
TickInterval=30
AttackCount=12
BulletAngle0=30
BulletAngle1=30
BulletAngle2=30
BulletAngle3=30
BulletAngle4=30
BulletAngle5=30
BulletAngle6=30
BulletAngle7=30
BulletAngle8=30
BulletAngle9=30
BulletAngle10=30
BulletCount0=3
BulletCount1=3
BulletCount2=3
BulletCount3=3
BulletCount4=3
BulletCount5=3
BulletCount6=3
BulletCount7=3
BulletCount8=3
BulletCount9=3
BulletCount10=3
BulletPos0=5
BulletPos1=7
BulletPos2=9

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=1

############################################## 페이즈2 작은 미사일#################################
[p2ms]
AnimationStart=화난표정미사일공격,5.0
Animation=화난표정미사일공격,1.0 #,1000,cycle
AnimationEnd=화난표정미사일공격,5.0
TickStart=30
TickInterval=30
AttackCount=3
BulletAngle0=8
BulletAngle1=8
BulletAngle2=8
BulletCount0=3
BulletCount1=3
BulletCount2=3
BulletPos0=5
#BulletPos1=7
#BulletPos2=9
#BulletPos3=8
#BulletPos4=10

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=1

############################################## 페이즈2 중간 미사일#################################
[p2mm]
AnimationStart=화난표정미사일공격,5.0
Animation=화난표정미사일공격,1.0 #,1000,cycle
AnimationEnd=화난표정미사일공격,5.0
TickStart=30
TickInterval=30
AttackCount=3
BulletAngle0=5
BulletAngle1=5
BulletAngle2=5
BulletCount0=4
BulletCount1=4
BulletCount2=4
BulletPos0=5
#BulletPos1=6
#BulletPos2=7
#BulletPos3=8
#BulletPos4=9

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=1

############################################## 페이즈2 큰 미사일#################################
[p2mb]
AnimationStart=화난표정미사일공격,5.0
Animation=화난표정미사일공격,1.0 #,1000,cycle
AnimationEnd=화난표정미사일공격,5.0
TickStart=20
TickInterval=30
AttackCount=1

#각 총알간 간격
BulletAngle0=30
BulletAngle1=30
#두번째 발사시 각도 휘어짐
BulletAngleNext=10
#한번쏠때 몇발을 쏠것인가
BulletCount0=12
BulletCount1=12
#첫번째 쏠때의 방향
BulletPos0=0
#두번째 쏠때의 방향
BulletPos1=10

#BulletPos2=33
#BulletPos3=66
#BulletPos4=99
#BulletPos5=132
#BulletPos6=165
#BulletPos7=198
#BulletPos8=231
#BulletPos9=265
#BulletPos10=298
#BulletPos11=330
LengthFromCenter=200

############################################## 페이즈2 호밍 미사일#################################
[p2mh]
AnimationStart=화난표정유도미사일공격,5.0
Animation=화난표정유도미사일공격,1.0,1000,once
AnimationEnd=화난표정유도미사일공격,5.0
TickStart=30
TickInterval=10
AttackCount=4
BulletAngle0=8
BulletAngle1=8
BulletCount0=2
BulletCount1=2
BulletPos0=5
BulletPos1=6
BulletPos2=7
BulletPos3=8
BulletPos4=9

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=0

############################################### 페이즈2 본드#########################################
[Bond]
AnimationStart=고스트(본드)준비,0.6,300,cycle
Animation=IDLE,0.1,300,once
AnimationEnd=고스트(본드)공격성공
AnimationCancel=고스트(본드)공격실패
BondCancelHP=60
StartOverTick=150
ScaleAttackedPercent=0.8
RestoringPercent=0.2


######################## 페이즈2 본드 공격시 나머지 한쪽 미사일 공격#################################
[MissileWhenBond]
AnimationStart=화난표정미사일공격,3.0,1000,cycle
Animation=화난표정미사일공격,1.0,1000,cycle
AnimationEnd=화난표정미사일공격,3.0,1000,cycle
TickStart=30
TickInterval=45
AttackCount=10
BulletAngle0=30
BulletAngle1=30
BulletAngle2=30
BulletAngle3=30
BulletAngle4=30
BulletAngle5=30
BulletAngle6=30
BulletAngle7=30
BulletAngle8=30
BulletAngle9=30
BulletAngle10=30
BulletCount0=3
BulletCount1=3
BulletCount2=3
BulletCount3=3
BulletCount4=3
BulletCount5=3
BulletCount6=3
BulletCount7=3
BulletCount8=3
BulletCount9=3
BulletCount10=3
BulletPos0=5
BulletPos1=7
#BulletPos2=9

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=1

############################################### 페이즈2 고스트#########################################
[Ghost]
GhostCancelHP=60
StartOverTick=150 #부풀어오르는 시간-데미지 입히는 시간
ScaleAttackedPercent=0.8 #공격당했을때 줄어드는 수치
RestoringPercent=0.2 #공격당한 후 다시 늘어나는 양
AnimationStart=고스트(본드)준비,0.6,300,cycle
Animation=IDLE,0.1,300,once
AnimationEnd=고스트(본드)공격성공
AnimationCancel=고스트(본드)공격실패

######################## 페이즈2 고스트 공격시 나머지 한쪽 미사일 공격#################################
[MissileWhenGhost]
AnimationStart=화난표정미사일공격,3.0,1000,cycle
Animation=화난표정미사일공격,1.0,1000,cycle
AnimationEnd=화난표정미사일공격,3.0,1000,cycle
TickStart=30
TickInterval=45
AttackCount=10
BulletAngle0=30
BulletAngle1=30
BulletAngle2=30
BulletAngle3=30
BulletAngle4=30
BulletAngle5=30
BulletAngle6=30
BulletAngle7=30
BulletAngle8=30
BulletAngle9=30
BulletAngle10=30
BulletCount0=3
BulletCount1=3
BulletCount2=3
BulletCount3=3
BulletCount4=3
BulletCount5=3
BulletCount6=3
BulletCount7=3
BulletCount8=3
BulletCount9=3
BulletCount10=3
BulletPos0=5
BulletPos1=7

#매번 타겟팅하면 1. 아니면 0. 값이 없으면 매번 타겟팅 안함
TargetChange=1

################################## 페이즈2 바닥쓸기 공격시 미사일 공격#################################
[p2DM]
Animation=Atk_Bullet,1,1500,cycle
TickStart=15
TickInterval=30
AttackCount=12
BulletAngle0=30
BulletAngle1=30
BulletAngle2=30
BulletAngle3=30
BulletAngle4=30
BulletAngle5=30
BulletAngle6=30
BulletAngle7=30
BulletAngle8=30
BulletAngle9=30
BulletAngle10=30
BulletCount0=3
BulletCount1=3
BulletCount2=3
BulletCount3=3
BulletCount4=3
BulletCount5=3
BulletCount6=3
BulletCount7=3
BulletCount8=3
BulletCount9=3
BulletCount10=3
BulletPos0=5
BulletPos1=7
BulletPos2=9


############################################### 페이즈2 바닥쓸기#########################################
[p2CircleMove]
AnimationStart=화난표정바닥쓸기,0.5
Animation=화난표정바닥쓸기,1,6000,cycle
AnimationEnd=화난표정바닥쓸기,1.0

# 지진 효과 = 시작틱, 끝틱, 반복틱, 주기시간, 진폭, 유지시간,방향(0=좌우,1=상하)
Shake=0,270,5,5,8,5,1

#강하
LandingVelocity=25
LandingEndTick=30
LandingOverEFX=
LandingOverSound=boss06@dashdown

#이동
DashTick=480
DashSpeedUpTick=100
DashSpeedDownTick=100
DashAccelTick=20
DashAccel=0
DashVelocityWhenStart=20
Direction=1 #-1=반대방향
#타원의 반지름과 y축 변수
Radius=680
yFactor=2.0
#중심좌표
centerX=800
centerY=600
#이펙트
DashEFX=CH00_DashHit00.efx
#사운드
DashSound=ch01@Dash

#부양
DashEndTick=30


#기본 속도
MovingVelocity=19



############################################### 페이즈2 가속#########################################
[SpeedUp]
AnimationStart=화난표정바닥쓸기,0.5
Animation=화난표정바닥쓸기,0.2,1000,cycle
AnimationEnd=화난표정바닥쓸기,1.0
MovingVelocity=20
EndTick=360
SpeedUpTick=60
SpeedDownTick=30
AccelTick=2.5
Accel=1
# 지진 효과 = 시작틱, 끝틱, 반복틱, 주기시간, 진폭, 유지시간,방향(0=좌우,1=상하)
Shake=0,270,10,10,10,10,1
############################################### 페이즈2 전기 공격######################################
#왼쪽 전기 공격 세팅
[ElectricAttack]
AnimationStart=화난표정전기공격,1.0
Animation=화난표정전기공격,0.2,1000,cycle
AnimationEnd=화난표정전기공격,1.0

#총 공격시간
TickStart=1
EndTick=360


[ElectricAttack1]
#AnimationStart=화난표정,0.2,100,cycle
#Animation=Idle,0.2,1000,cycle
#AnimationEnd=화난표정,0.2,2000,cycle
BulletAngle=15
BulletCount=3
Barrel=180
Angle0=2
Angle1=100
Angle2=240
#Angle3=120
#Angle4=130
#Angle5=140
#Angle6=150
#Angle7=160
MaxLengthLaser=1300

# 시작/메인/끝 모션 설정
StartAnimation=Idle,1.0
FireAnimation=Idle,1.0,1000,cycle
Fire1Animation=Idle,1.0
EndAnimation=Idle

# (왼쪽 레이저 기준) 시작 각도 : 0도가 3시, 시계방향
StartAngle=70
Start1Angle=50

# 틱당 각속도
SpeedAngle=0.25

# 레이저 굵기, 충전, 동작 시간 등등 : StartAnimation/FireAnimation의 시간과 맞춰야
Width=50
PrepareTime=2000
OnTime=11400
ProofTick=60
Damage=45
Radius=1.0
 
# 레이저 이펙
#ChargeName=
#FireName=
#LaserName=Effects/Quest06/Efx/Boss06_LightingAttack.efx
#ExplodeName=
#DamageName=Effects/Quest06/Efx/Boss06_LightingDamage.efx

# 레이저 이펙
ChargeName=Effects/Quest06/Efx/Boss06_LightingCharge.efx
FireName=Effects/Quest06/Efx/Boss06_LightingAttackShooting.efx
LaserName=Effects/Quest06/Efx/Boss06_LightingAttack.efx
ExplodeName=Effects/Quest06/Efx/Boss06_LightingStaticExplo.efx
DamageName=Effects/Quest06/Efx/Boss06_LightingDamage.efx
InterExplodeTick=3

# 지진 효과 = 시작틱, 끝틱, 반복틱, 주기시간ms, 진폭, 유지시간ms, 방향(0=좌우,1=상하)
Shake=10,92,2,100,4,100,1
Shake1=10,126,2,100,4,100,1


[ElectricAttack2]
#AnimationStart=화난표정,0.2,100,cycle
#Animation=Idle,0.2,1000,cycle
#AnimationEnd=화난표정,0.2,2000,cycle
BulletAngle=15
BulletCount=3
Barrel=180
Angle0=330
Angle1=50
Angle2=160
#Angle3=120
#Angle4=130
#Angle5=140
#Angle6=150
#Angle7=160
MaxLengthLaser=1300

# 시작/메인/끝 모션 설정
StartAnimation=Idle,1.0
FireAnimation=Idle,1.0,1000,cycle
Fire1Animation=Idle,1.0
EndAnimation=Idle

# (왼쪽 레이저 기준) 시작 각도 : 0도가 3시, 시계방향
StartAngle=70
Start1Angle=50

# 틱당 각속도
SpeedAngle=0.35

# 레이저 굵기, 충전, 동작 시간 등등 : StartAnimation/FireAnimation의 시간과 맞춰야
Width=50
PrepareTime=2000
OnTime=11400
ProofTick=60
Damage=45
Radius=1.0
 
# 레이저 이펙
#ChargeName=
#FireName=
#LaserName=Effects/Quest06/Efx/Boss06_LightingAttack.efx
#ExplodeName=
#DamageName=Effects/Quest06/Efx/Boss06_LightingDamage.efx


# 레이저 이펙
ChargeName=Effects/Quest06/Efx/Boss06_LightingCharge.efx
FireName=Effects/Quest06/Efx/Boss06_LightingAttackShooting.efx
LaserName=Effects/Quest06/Efx/Boss06_LightingAttack.efx
ExplodeName=Effects/Quest06/Efx/Boss06_LightingStaticExplo.efx
DamageName=Effects/Quest06/Efx/Boss06_LightingDamage.efx
InterExplodeTick=3

# 지진 효과 = 시작틱, 끝틱, 반복틱, 주기시간ms, 진폭, 유지시간ms, 방향(0=좌우,1=상하)
Shake=10,92,2,100,4,100,1
Shake1=10,126,2,100,4,100,1